{
  "backend/main.mo": "Actor managing user profiles and anonymous-access vehicle tuning settings, with authorization checks only for profile operations and validation for car tuning parameters.",
  "backend/migration.mo": "Migration module converting old actor state to a new version by adding a throttleSettings map while preserving existing data.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Collection of pre-written summaries describing the purpose of each frontend file.",
  "frontend/index.css": "Tailwind-based global styling defining light/dark theme variables and base layout rules.",
  "frontend/index.html": "HTML entry point bootstrapping the React application and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app component handling section routing via a carousel menu and rendering the appropriate tuning or placeholder panel.",
  "frontend/src/components/CarTuningPanel.tsx": "UI panel that loads, displays, and updates drive mode and tuning parameters with sliders and error handling.",
  "frontend/src/components/DemoNotice.tsx": "Empty placeholder component file.",
  "frontend/src/components/ErrorBanner.tsx": "Reusable error alert component that displays a message with destructive styling.",
  "frontend/src/components/FuelInjectionPanel.tsx": "Panel for viewing and adjusting fuel injection settings via sliders and backend mutations.",
  "frontend/src/components/LoginButton.tsx": "Empty placeholder component file.",
  "frontend/src/components/ModeSelector.tsx": "Tabs-based selector for choosing a drive mode with icons and descriptions.",
  "frontend/src/components/OilChangePanel.tsx": "Displays static oil condition status using a styled card.",
  "frontend/src/components/ProfileSetup.tsx": "Empty placeholder component file.",
  "frontend/src/components/ScooterTuningPanel.tsx": "Panel for loading, editing, and saving scooter tuning settings with multiple sliders.",
  "frontend/src/components/SectionPlaceholderPanel.tsx": "Generic placeholder section that shows a title, description, and unavailable feature message.",
  "frontend/src/components/ThrottlePanel.tsx": "Panel for adjusting throttle sensitivity with a single slider and saving the value.",
  "frontend/src/components/TopIconCarouselMenu.tsx": "Horizontal icon-based menu with drag scrolling for selecting sections; includes default item list.",
  "frontend/src/components/TuningSlider.tsx": "A UI component rendering a labeled slider with formatted value display and visual indicator dots.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useFuelInjectionSettings.ts": "Fetches, initializes defaults, and saves fuel injection settings with optimistic updates.",
  "frontend/src/hooks/useHorizontalDragScroll.ts": "Provides a ref enabling horizontal drag-to-scroll behavior for any element.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state and exposes login, logout, and identity context.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file for hooks.",
  "frontend/src/hooks/useScooterTuningConfig.ts": "Fetches, initializes defaults, and saves scooter tuning configs with optimistic updates.",
  "frontend/src/hooks/useThrottleSetting.ts": "Loads and saves a numeric throttle setting with validation and optimistic updates.",
  "frontend/src/hooks/useTuningConfig.ts": "Fetches and updates car tuning configuration, including drive mode and tuning parameters.",
  "frontend/src/index.css": "Tailwind base styles plus custom CSS variables, dark mode settings, and utility classes.",
  "frontend/src/lib/utils.ts": "Provides a helper function for merging class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point setting up React Query, identity provider, and rendering App.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters, persist them in sessionStorage, and manage hash-based query cleanup.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, animations, and plugins for a dark futuristic UI.",
  "project_state.json": "Describes project state, features, known issues, and requirements for a futuristic car‑tuning demo app."
}